{
	"version" : "1.27.0",
	"feature-introduction" : true,
	"content" : {
		"zh-CN" : [
			"新增了每几轮计时进行一次长休息、在计时结束前几秒弹出通知提示的功能，可以在设置面板中打开。",
			"新增了第一轮工作计时缩短一定时间的功能，使计时更加灵活，可以在计时主界面“更多设置”菜单中打开。",
			"使用自制提示框替换系统提示框，减少看不到提示窗口的情况。",
			"修复了外置标题窗口中笔记无法同步、正计时时托盘菜单中计时信息显示错误的问题。",
			"我们收到了关于 wnr 的 MINI 模式窗口在 Windows 10/11 系统上部分播放器全屏后无法显示的问题，但暂未解决，欢迎 Pull Request。"
		],
		"zh-TW" : [
			"新增了每幾輪計時進行一次長休息、在計時結束前幾秒彈出通知提示的功能，可以在設置面板中打開。",
			"新增了第一輪工作計時縮短一定時間的功能，使計時更加靈活，可以在計時主界面“更多設置”菜單中打開。",
			"使用自制提示框替換系統提示框，減少看不到提示窗口的情況。",
			"修復了外置標題窗口中筆記無法同步、正計時時托盤菜單中計時信息顯示錯誤的問題。",
			"我們收到了關於 wnr 的 MINI 模式窗口在 Windows 10/11 系統上部分播放器全屏後無法顯示的問題，但暫未解決，歡迎 Pull Request。"
		],
		"en" : [
			"New features: 1. Optimized long break, 2. Notification before a time period will end in seconds, 3.First work period discount, 4. A new dialog box style that can prevent being hidden.",
			"Bugs fixed about: 1. Note sync in eternal title window, 2. Tray message malfunction in stopwatch mode.",
			"Help wanted: Some users said that MINI mode fails to show when some video players are fullscreened, but I couldn't solve it. Pull Requests are welcomed."

		]
	},
	"introduce" : {
		"id" : "introduced-1.27.0",
		"zh-CN" : {
			"title" : "<b>欢迎升级至 1.27.0：</b>新功能概览",
			"description" : {
				"universal" : "<p>1. 新增了每几轮计时进行一次长休息、在计时结束前几秒弹出通知提示的功能，可以在设置面板中打开。</p><p>2. 还新增了第一轮工作计时缩短一定时间的功能，使计时更加灵活，可以在计时主界面“更多设置”菜单中打开。</p>",
				"darwin" : "",
				"win32" : ""
			}
		},
		"zh-TW" : {
			"title" : "<b>歡迎升級至 1.27.0：</b>新功能概覽",
			"description" : {
				"universal" : "<p>1. 新增了每幾輪計時進行一次長休息、在計時結束前幾秒彈出通知提示的功能，可以在設置面板中打開。</p><p>2. 還新增了第一輪工作計時縮短一定時間的功能，使計時更加靈活，可以在計時主界面“更多設置”菜單中打開。</p>",
				"darwin" : "",
				"win32" : ""
			}
		},
		"en" : {
			"title" : "<b>Welcome to v1.27.0!</b>",
			"description" : {
				"universal" : "<p>New features: 1. Optimized long break (toggle in preferences panel), 2. Notification before a time period will end in seconds (toggle in preferences panel), 3.First work period discount (toggle in more items in index page), 4. A new dialog box style that can prevent being hidden.</p>",
				"darwin" : "",
				"win32" : ""
			}
		}
	}
}