{
	"version": "1.25.0",
	"feature-introduction": false,
	"content": {
		"zh-CN": [
			"此版本主要解决了此前几个月由于准备考试未能解决的诸 issues 中提出的问题和功能，以及一些新发现的 bugs，并开始提供 arm64 版本的 macOS 包裹。",
			"优化以下功能：统计模块、单纯计时功能、核心计时组件。",
			"添加一些设置项：时间段结束后提醒的通知但不弹出模式、调节提示音音量、界面缩放、设置星期的第一天。",
			"修复了以下 bugs：家长控制模式下多进程屏蔽失效、强制退出后再进入剩余时间不正确、菜单中显示或隐藏按钮在macOS上功能不正常等。"
		],
		"zh-TW": [
			"此版本主要解決了此前幾個月由於準備考試未能解決的諸 issues 中提出的問題和功能，以及一些新發現的 bugs，並開始提供 arm64 版本的 macOS 包裹。",
			"優化以下功能：統計模塊、單純計時功能、核心計時組件。",
			"添加一些設置項：時間段結束後提醒的通知但不彈出模式、調節提示音音量、界面縮放、設置星期的第一天。",
			"修復了以下 bugs：家長控制模式下多進程屏蔽失效、強制退出後再進入剩餘時間不正確、菜單中顯示或隱藏按鈕在macOS上功能不正常等。"
		],
		"en": [
			"This version mainly solved the issues that wasn't fixed during the last semester when I was busily preparing for my exams. Also, arm64 (M1) arch of macOS is now natively supported.",
			"Optimized: statistics, simple countdown mode and core timing component.",
			"Updated settings panel: no pop-up mode for notifying when a period of time finishes, notify sound volume control, window zoom ratio control and changing the first day of a week.",
			"Fixed several bugs related to timing, parent-control mode and macOS experience."
		]
	},
	"introduce": {
		"id": "introduced-1.21.0",
		"zh-CN": {
			"title": "不少新功能。",
			"description": {
				"darwin": "我们有了新的快捷键系统。访问操作->设置->个性化设置见识一下它们。",
				"win32": "我们有了新的快捷键系统。点击wnr徽标，选择“设置->个性化设置”来见识一下它们。",
				"universal": "\n此外，新的“单纯计时”模式等更新，大概也会让你耳目一新吧。"
			}
		},
		"zh-TW": {
			"title": "不少新功能。",
			"description": {
				"darwin": "我們有了新的快捷鍵系統。訪問操作->設置->個性化設置見識一下它們。",
				"win32": "我們有了新的快捷鍵系統。點擊wnr徽標，選擇“設置->個性化設置”來見識一下它們。",
				"universal": "\n此外，新的“單純計時”模式等更新，大概也會讓你耳目一新吧。"
			}
		},
		"en": {
			"title": "Many new features",
			"description": {
				"darwin": "We now have a new hotkey system. Go to Top Bar -> Operations -> Settings -> Personalization to see it.",
				"win32": "We now have a new hotkey system. Click Logo icon -> Settings -> Personalization to see it.",
				"universal": "\n Moreover, other new features like the new \"Just Timing\" mode may also attract you!"
			}
		}
	}
}